In [1]:
import pandas as pd

In [19]:
df1 = pd.DataFrame({'name':['xiaoming','hong','gang','qing','hah'],'age':[23,24,25,26,27]})
df2 = pd.DataFrame({'name':['xiaoming','john','mark','gang'],'call_name':['xiaoming','john','mark','gang'],'score':[100,99,89,97]})

In [10]:
df1

   age      name
0   23  xiaoming
1   24      hong
2   25      gang
3   26      qing
4   27       hah

In [20]:
df2

  call_name      name  score
0  xiaoming  xiaoming    100
1      john      john     99
2      mark      mark     89
3      gang      gang     97

In [12]:
df3 = pd.merge(df1,df2)
df3

   age      name  score
0   23  xiaoming    100
1   25      gang     97

In [22]:
df4 = pd.merge(df1,df2,left_on='name',right_on='call_name')
df4

   age    name_x call_name    name_y  score
0   23  xiaoming  xiaoming  xiaoming    100
1   25      gang      gang      gang     97